# Data Understanding 

using the tips data

Goal:

    Make visualization
    Fix problem in data:
        missing values, Outliers, Duplicate records
    Ready to proceed clusting...

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
%matplotlib inline
import math
import numpy as np
import pandas as pd
import scipy.stats as stats
import matplotlib.pyplot as plt

from collections import defaultdict
from scipy.stats.stats import pearsonr

## Loading data with pandas

In [7]:
df = pd.read_csv('/content/drive/MyDrive/DataUnd/tips-id.csv', sep='\t', index_col=0) #set correct delimiter,index column
df_age = pd.read_csv('/content/drive/MyDrive/DataUnd/age-tips.csv', sep='\t', index_col=0)
df_err = pd.read_csv('/content/drive/MyDrive/DataUnd/tips-error.csv')

In [ ]:
print(df.head())
print()
print(df.tail())

   ID  total_bill   tip     sex smoker  day    time  size
0   1       16.99  1.01  Female    NaN  Sun  Dinner     2
1   2       10.34  1.66    Male     No  Sun  Dinner     3
2   3       21.01  3.50    Male     No  Sun  Dinner     3
3   4       23.68  3.31    Male     No  Sun  Dinner     2
4   5       24.59  3.61  Female     No  Sun  Dinner     4

      ID  total_bill   tip     sex smoker   day    time  size
239  240       29.03  5.92    Male     No   Sat  Dinner     3
240  241       27.18  2.00  Female    Yes   Sat  Dinner     2
241  242       22.67  2.00    Male    Yes   Sat  Dinner     2
242  243       17.82  1.75    Male     No   Sat  Dinner     2
243  244       18.78  3.00  Female     No  Thur  Dinner     2

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          244 non-null    int64
 1   total_bill  244 non-null    float64
 2   tip         244 non-null    float64
 3   sex         244 non-null    object
 4   smoker      242 non-null    object
 5   day         244 non-null    object
 6   time        244 non-null    object
 7   size        244 non-null    int64
dtypes: float64(2), int64(2), object(4)
memory usage: 15.4+ KB

Comment:
1.pandas dataframe

object and float

In [ ]:
df.dtypes

ID              int64
total_bill    float64
tip           float64
sex            object
smoker         object
day            object
time           object
size            int64
dtype: object

In [ ]:
df_age

     age  gender
ID
1     57  Female
2     23    Male
3     62    Male
4      0    Male
5      0  Female
..   ...     ...
240   25    Male
241   42  Female
242   64    Male
243   72    Male
244   63  Female

[244 rows x 2 columns]

In [ ]:
join_df = df.join(df_age, on='ID') #need to set index_col = 0 for df_age

In [ ]:
join_df.drop(columns=['gender'], inplace=True)

#analyse the context to pick missing value
e.g. nan ,0

In [ ]:

df_err.head()

  total_bill   tip     sex smoker  day    time  size
0      aaaaa   NaN  Female     No  Sun  Dinner     2
1      10.34  1.66     NaN     No  Sun  Dinner     3
2      21.01  3.50    Male     No  Sun  Dinner     3
3      23.68  3.31    Male     No  Sun  Dinner     2
4      24.59  3.61  Female     No  Sun  Dinner     4

In [ ]:
df_err.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    object
 1   tip         243 non-null    float64
 2   sex         243 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(1), int64(1), object(5)
memory usage: 13.5+ KB

object for totalbill
missing value for tip and sex
in big data, we need infer
replace with a dummy val

In [ ]:
df_err['total_bill'].replace({'aaaaa':0, 'bbbbb':0}, inplace=True)

In [ ]:
df_err.head(2)

  total_bill   tip     sex smoker  day    time  size
0          0   NaN  Female     No  Sun  Dinner     2
1      10.34  1.66     NaN     No  Sun  Dinner     3

In [ ]:
join_df.describe() #only numerical

       total_bill         tip        size         age
count  244.000000  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672   45.180328
std      8.902412    1.383638    0.951100   23.399031
min      3.070000    1.000000    1.000000    0.000000
25%     13.347500    2.000000    2.000000   25.000000
50%     17.795000    2.900000    2.000000   44.000000
75%     24.127500    3.562500    3.000000   67.000000
max     50.810000   10.000000    6.000000   80.000000

In [ ]:


df_err.select_dtypes(include=['float64'])

      tip
0     NaN
1    1.66
2    3.50
3    3.31
4    3.61
..    ...
239  5.92
240  2.00
241  2.00
242  1.75
243  3.00

[244 rows x 1 columns]

In [ ]:
df_err.infer_objects().dtypes

total_bill     object
tip           float64
sex            object
smoker         object
day            object
time           object
size            int64
dtype: object

In [ ]:
#df_err[df_err['total_bill'].apply(lambda x: isinstance(x, object))]
#df_err['total_bill'].query(dtype = float)
#df_err['total_bill'].dtype[float]

KeyError: 'There are no fields in dtype object.'